Documents/NomenclaturePricing.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>NomenclaturePricing</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.NomenclaturePrices</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ResponsibleUser</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Products</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Nomenclature</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Nomenclature</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Characteristic</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.NomenclatureCharacteristics</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Package</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.NomenclaturePackages</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PriceCategory</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.PriceCategories</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/NomenclaturePricing/Ext/ManagerModule.bsl
Procedure InitializeDocumentData(DocumentRef, AdditionalProperties) Export

	Query = New Query(
	// 0 TableNomenclaturePrices
	"SELECT
	|	Products.Nomenclature AS Nomenclature,
	|	Products.Characteristic AS Characteristic,
	|	Products.Package AS Package,
	|	Products.PriceCategory AS PriceCategory,
	|	Products.Price AS Price,
	|	Products.PriceCategory.PriceCurrency AS Currency,
	|	Products.Ref.Date AS PERIOD
	|FROM
	|	Document.NomenclaturePricing.Products AS Products
	|WHERE
	|	Products.Ref = &Reference");

	Query.SetParameter("Reference", DocumentRef);
	Result = Query.ExecuteBatch();

	AdditionalProperties.RegisterRecords.Insert("TableProducts", Result[0].Unload());

EndProcedure // InitializeDocumentData()
